app/controllers/remotereservation_controller.rb

  def find_by_campername
    session[:reservation_id] = nil
    session[:payment_id] = nil
    @reservations = Reservation.all(:conditions => ["confirm = ? and camper_id = ?", true, params[:camper_id].to_i])
    debug "found #{@reservations.size} reservations"
    if @reservations.size > 1
      @page_title = I18n.t('titles.ResName', :name => @reservations[0].camper.full_name)
    elsif @reservations.size == 1
      @reservation = @reservations[0]
      session[:reservation_id] = @reservation.id
      if @reservation.archived
	begin
	  archived = Archive.find_by_reservation_id @reservation.id
	  @reason = archived.close_reason
	rescue
	  @reason = 'unknown'
	end
      end
      redirect_to :action => :show, :reservation_id => @reservation.id
    else
      begin
	camper = Camper.find params[:camper_id].to_i
---
SELECT * FROM `campers` WHERE (`campers`.`id` IN (6,8,1,2,10,4))