app/controllers/remotereservation_controller.rb

  def index
    @page_title = I18n.t('titles.new_res')
    debug 'In remote index'
    session[:remote] = true
    session[:controller] = :remote
    session[:action] = :index
    ####################################################
    # new reservation.  Just make available all of
    # the fields needed for a reservation
    ####################################################
    flash.now[:error] = params[:flash] if params[:flash]
    begin
      @prompt = Prompt.find_by_display_and_locale!('index', I18n.locale.to_s)
    rescue
      @prompt = Prompt.find_by_display_and_locale('index', 'en')
    end
    if session[:reservation_id]
      begin
        @reservation = Reservation.find session[:reservation_id].to_i
---
SELECT * FROM `reservations` WHERE ((enddate >= '2022-03-26' or checked_in = 1) and confirm = 1 and archived = 0) ORDER BY space_id,startdate ASC

    session[:month] = @reservation.startdate.month.to_s
    session[:year] = @reservation.startdate.year.to_s
    if @option.show_remote_available?
      @count = Space.available( @reservation.startdate, @reservation.enddate, 0).size
---
SELECT * FROM `spaces` WHERE (active = 1 AND unavailable = 0 AND id NOT IN (SELECT space_id FROM reservations WHERE archived = 0 AND enddate > '2022-03-26' AND startdate < '2022-03-27' )) ORDER BY position