app/controllers/reservation_controller.rb

SELECT * FROM `reservations` WHERE (CONFIRM = 0 and updated_at < '2022-03-26 03:41:36' and archived = 0)
---
	def new
		@page_title = I18n.t('titles.new_res')
		####################################################
		# new reservation.  Just make available all of
		# the fields needed for a reservation
		####################################################

		session[:payment_id] = nil if session[:payment_id]
		if params[:stage] == 'new'
			@reservation = Reservation.new
			@reservation.startdate = currentDate
			@reservation.enddate = @reservation.startdate + 1
			session[:reservation_id] = nil
			session[:payment_id] = nil
			session[:desired_type] = 0
		else
			begin
				@reservation = Reservation.find session[:reservation_id].to_i

SELECT * FROM `spaces` WHERE (active = 1 AND unavailable = 0 AND id NOT IN (SELECT space_id FROM reservations WHERE archived = 0 AND enddate > '2022-03-26' AND startdate < '2022-03-27' )) ORDER BY position
---
		@storage_ok = @option.use_storage
		# we will not save the res because if we will
		# need it later it is already saved
		@count  = Space.available( @reservation.startdate, @reservation.enddate, session[:desired_type]).size if @option.show_available?

INSERT INTO `reservations` (`special_request`, `checked_in`, `pets`, `tax_str`, `camper_id`, `vehicle_state`, `created_at`, `enddate`, `confirm`, `unconfirmed_remote`, `checked_out`, `discount_id`, `ext_charges`, `seasonal`, `updated_at`, `kids`, `lock_version`, `total`, `log`, `archived`, `group_id`, `vehicle_license`, `adults`, `tax_amount`, `vehicle_license_2`, `gateway_transaction`, `updated_on`, `sitetype_id`, `cancel_charge`, `slides`, `rig_age`, `seasonal_charges`, `storage`, `length`, `vehicle_state_2`, `recommender_id`, `onetime_discount`, `next`, `cancelled`, `rigtype_id`, `space_id`, `startdate`, `long_term_monthly`, `deposit`, `override_total`, `seasonal_rate`, `prev`) VALUES(NULL, 0, 0, NULL, 0, NULL, '2022-03-26 04:11:34', '2022-04-07', 0, 0, 0, 1, 0.0, 0, '2022-03-26 04:11:34', 0, 0, 0.0, NULL, 0, NULL, NULL, 2, 0.0, NULL, NULL, '2022-03-26 04:11:34', 0, 0.0, 0, 0, 0.0, 0, 0, NULL, 0, 0.0, NULL, 0, 0, 0, '2022-04-04', 0, 0.0, 0.0, 0.0, NULL)
---
	def express_2
		unless params[:space] && params[:reservation]
			redirect_to :action => :express and return
		end
		# first time through
		@reservation = Reservation.new(params[:reservation])
		@reservation.startdate = @date_start
		@reservation.enddate = @date_end
		unless Campground.open?(@reservation.startdate, @reservation.enddate)
			flash[:error] = I18n.t('reservation.Flash.SpaceUnavailable') +
					"<br />" +
					I18n.t('reservation.Flash.ClosedDates', :closed => DateFmt.format_date(@option.closed_start), :open => DateFmt.format_date(@option.closed_end))
			redirect_to :action => :express and return
		end
		flash[:warning] = I18n.t('reservation.Flash.EarlyStart') if @reservation.startdate < currentDate
		@reservation.save!

SELECT * FROM `spaces` ORDER BY position LIMIT 1
---
	def list
		@page_title = I18n.t('titles.res_list')
		if session[:user_id]
			####################################################
			# List all reservations.  This is used
			# as the central focus of the application.  Sort
			# by the start date, group and space of the reservation
			####################################################
			session[:next_controller] = nil
			session[:next_action] = nil
			session[:reservation_id] = nil
			if (Space.first == nil)  # this is for startup with no spaces defined

SELECT * FROM `payments` WHERE (`payments`.`reservation_id` = 95)
UPDATE `reservations`
---
	def space_selected
		@page_title = I18n.t('titles.Review')
		####################################################
		# the space has been selected, now compute the total
		# charges and fetch info for display and completion
		####################################################

		@reservation = get_reservation
		@payments = Payment.find_all_by_reservation_id @reservation.id
		# if we are changing dates we will not have a space in params
		@reservation.space_id = params[:space_id].to_i if params[:space_id]
		check_length @reservation
		spaces = Space.confirm_available(@reservation.id, @reservation.space_id, @reservation.startdate, @reservation.enddate)
		# debug "#{spaces.size} spaces in conflict"
		if spaces.size > 0
			flash[:error] = I18n.t('reservation.Flash.Conflict')
			error 'space conflict'
			redirect_to :action => :new and return
		end
		@reservation.save!

SELECT * FROM `integrations` LIMIT 1
---
		@reservation.save!
		# session[:reservation_id] = @reservation.id
		@use_navigation = false
		@integration = Integration.first

SELECT * FROM `extras` WHERE (remote_display = 1 AND extra_type != 2 AND active = 1) ORDER BY position
---
	def find_space
		@page_title = I18n.t('titles.SelSpace')
		####################################################
		# given the parameters specified find all spaces not
		# already reserved that fit the spec and supply data
		# for presentation
		# We will save the data selected the first time
		# in the session to be used when we advance from
		# page to page.
		####################################################
		if params[:reservation]
			# first time through
			@reservation = Reservation.new(params[:reservation])
			@reservation.startdate = @date_start
			@reservation.enddate = @date_end
			debug "start #{@date_start}, end #{@date_end}"
			unless Campground.open?(@reservation.startdate, @reservation.enddate) ||
			(@option.use_storage? && @reservation.storage?)
	flash[:error] = I18n.t('reservation.Flash.SpaceUnavailable') +
			"<br />" +
			I18n.t('reservation.Flash.ClosedDates', :closed => DateFmt.format_date(@option.closed_start), :open => DateFmt.format_date(@option.closed_end))
	redirect_to :action => :new and return
			end
			flash.now[:warning] = I18n.t('reservation.Flash.EarlyStart') if @reservation.startdate < currentDate
			@reservation.save!
			if params[:extra]
	extras = Extra.active
	extras.each do |e|

SELECT * FROM `charges` WHERE (reservation_id = 96) ORDER BY start_date ASC
SELECT * FROM `extra_charges` WHERE (`extra_charges`.`extra_id` = 2 AND `extra_charges`.`reservation_id` = 96) LIMIT 1
INSERT INTO `charges` (`start_date`, `temp`, `discount`, `period`, `rate`, `amount`, `season_id`, `charge_units`, `reservation_id`, `end_date`) VALUES('2022-04-03', 0, 0.0, 4.0, 24.0, 96.0, 1, 0, 96, '2022-04-07')
---
				debug "and it is true"
				@reservation.extras << e
				debug "added extra #{e.id}"
				ec=ExtraCharge.first(:conditions => [ "extra_id = ? and reservation_id = ?",
								 e.id, @reservation.id] )
				if e.extra_type == Extra::COUNTED
		ec.save_charges((params[:extra][ct_key]).to_i)

SELECT * FROM `seasons` WHERE (active = 1 and applies_to_monthly = 1 and startdate <= '2022-04-03' and enddate >= '2022-04-03') ORDER BY startdate DESC
---
			if @reservation.seasonal?
				session[:season] = 1
			else
	session[:season] = Season.find_by_date(@reservation.startdate).id

SELECT * FROM `reservations` WHERE ((enddate >= '2022-03-26' or checked_in = 1) and confirm = 1 and archived = 0) ORDER BY space_id,startdate ASC
SELECT * FROM `seasons` WHERE (`seasons`.`id` = 1)
SELECT * FROM `sitetypes` WHERE (active = 1) ORDER BY position
---
			session[:startdate] = @reservation.startdate
			session[:enddate] = @reservation.enddate
		end
		@reservation = Reservation.find session[:reservation_id].to_i unless defined?(@reservation)
		@season = Season.find(session[:season].to_i)
		spaces = spaces_for_display(@reservation, @season, @reservation.sitetype_id)
		@spaces = spaces.paginate :page => params[:page], :per_page => @option.disp_rows

SELECT * FROM `archives` WHERE (reservation_id = 0)
---
	def find_by_number
		####################################################
		# find a reservation given the reservation number
		####################################################
		session[:reservation_id] = nil
		session[:payment_id] = nil
		begin
			@reservation = Reservation.find(params[:reservation][:id].to_i)
			if @reservation.archived
	begin
		archived = Archive.find_by_reservation_id @reservation.id

SELECT * FROM `campers` WHERE (`campers`.`id` = 2) ORDER BY last_name, first_name asc
---
	def find_by_campername
		session[:reservation_id] = nil
		session[:payment_id] = nil
		@reservations = Reservation.all(:conditions => ["confirm = ? and camper_id = ?", true, params[:camper_id].to_i])
		debug "found #{@reservations.size} reservations"
		if @reservations.size > 1
			@page_title = I18n.t('titles.ResName', :name => @reservations[0].camper.full_name)
		elsif @reservations.size == 1
			@reservation = @reservations[0]
			session[:reservation_id] = @reservation.id
			if @reservation.archived
	begin
		archived = Archive.find_by_reservation_id @reservation.id
		@reason = archived.close_reason
	rescue
		@reason = 'unknown'
	end
			end
			redirect_to :action => :show, :reservation_id => @reservation.id
		else
			begin
	camper = Camper.find params[:camper_id].to_i

SELECT * FROM `spaces` WHERE (active = 1) ORDER BY position
---
		# check for conflicts aka double booking
		res.each do |r|
			sp = Space.confirm_available r.id, r.space_id, r.startdate, r.enddate
			if sp.size > 0

SELECT * FROM `spaces` WHERE (active = 1) ORDER BY position
---
		# check for conflicts aka double booking
		res.each do |r|
			sp = Space.confirm_available r.id, r.space_id, r.startdate, r.enddate
			if sp.size > 0

SELECT * FROM `spaces` WHERE (active = 1) ORDER BY position
---
		# check for conflicts aka double booking
		res.each do |r|
			sp = Space.confirm_available r.id, r.space_id, r.startdate, r.enddate
			if sp.size > 0

SELECT * FROM `spaces` WHERE (active = 1) ORDER BY position
---
		# check for conflicts aka double booking
		res.each do |r|
			sp = Space.confirm_available r.id, r.space_id, r.startdate, r.enddate
			if sp.size > 0

SELECT * FROM `payments` WHERE (amount = 0.0 and created_at < '2022-02-04 05:05:29' and credit_card_no = '' and cc_fee = 0.0)
---
	def set_payment_deposit_formatted
		@reservation = get_reservation
		if params[:value]
			pmt = currency_2_number(params[:value])
			if @option.use_login && defined? @user_login
	name = @user_login.name
			else
	name = ""
			end
			if session[:payment_id]
	@payment = Payment.find session[:payment_id].to_i