app/controllers/reservation_controller.rb

SELECT * FROM `spaces` WHERE (active = 1 AND unavailable = 0 AND id NOT IN (SELECT space_id FROM reservations WHERE archived = 0 AND enddate > '2022-02-05' AND startdate < '2022-02-06' )) ORDER BY position
---
		@storage_ok = false
		# we will not save the res because if we will
		# need it later it is already saved
		@spaces  = Space.all()